In [6]:
import pandas as pd

In [7]:
clientes = {
'id_cliente': ['A100', 'B100', 'A200', 'C100'],
    'ant': [3, 12, 1, 7], 
'consumo': [30,25,51,29]
}

In [8]:
clientes

{'id_cliente': ['A100', 'B100', 'A200', 'C100'],
 'ant': [3, 12, 1, 7],
 'consumo': [30, 25, 51, 29]}

In [9]:
df_clientes =pd.DataFrame(clientes)
df_clientes

  id_cliente  ant  consumo
0       A100    3       30
1       B100   12       25
2       A200    1       51
3       C100    7       29

In [10]:
df_clientes.count()

id_cliente    4
ant           4
consumo       4
dtype: int64

In [11]:
df_clientes.dtypes

id_cliente    object
ant            int64
consumo        int64
dtype: object

In [12]:
df_turistas_mad = pd.read_csv("ficheros\\TURISTAS_MAD.txt",sep=';', header='infer')

In [15]:
df_turistas_mad.head()

   id_turista procedencia fec_salida fec_llegada  gasto
0     5100501     America   21/12/18    13/12/18    920
1     5100502        Asia   21/12/18    12/12/18   1797
2     5100503     America   25/01/18    13/01/18   2172
3     5100504        Asia   26/01/18    13/01/18   1762
4     5100505      Europa   10/09/18    31/08/18   1070

In [16]:
df_turistas_mad.dtypes

id_turista      int64
procedencia    object
fec_salida     object
fec_llegada    object
gasto           int64
dtype: object

In [17]:
df_turistas_mad.shape

(1000, 5)

In [ ]:

df_turistas_mad['fec_salida_2']=pd.to_datetime(df_turistas_mad['fec_salida'], format="%d/%m/%y")
df_turistas_mad['fec_llegado_2']=pd.to_datetime(df_turistas_mad['fec_llegada'], format="%d/%m/%y")

In [ ]:
df_turistas_mad.dtypes

In [ ]:
df_turistas_mad['duracion'] = df_turistas_mad['fec_llegado_2']-df_turistas_mad['fec_salida_2']

In [ ]:
df_turistas_mad.head()

In [ ]:
df_turistas_mad=df_turistas_mad.copy()

In [ ]:
df_turistas_mad_2=df_turistas_mad.loc[0:10,['procedencia','id_turista']]

In [ ]:
df_turistas_mad_2.head()

In [ ]:
df_turistas_mad_2=df_turistas_mad.iloc[:,[2,4]].sample(10).copy()

In [ ]:
df_turistas_mad_2

In [ ]:
dfl =sets("1","2")

In [ ]:
df_turistas

In [18]:
df_turistas_mad.to_string

<bound method DataFrame.to_string of      id_turista procedencia fec_salida fec_llegada  gasto
0       5100501     America   21/12/18    13/12/18    920
1       5100502        Asia   21/12/18    12/12/18   1797
2       5100503     America   25/01/18    13/01/18   2172
3       5100504        Asia   26/01/18    13/01/18   1762
4       5100505      Europa   10/09/18    31/08/18   1070
..          ...         ...        ...         ...    ...
995     5101496        Asia   17/12/18    05/12/18   1098
996     5101497      Europa   13/06/18    09/06/18    724
997     5101498     America   04/04/18    28/03/18   1365
998     5101499     America   13/04/18    31/03/18   1534
999     5101500        Asia   28/05/18    19/05/18   2031

[1000 rows x 5 columns]>

In [20]:
df_turistas_mad.loc[[0,1]]

   id_turista procedencia fec_salida fec_llegada  gasto
0     5100501     America   21/12/18    13/12/18    920
1     5100502        Asia   21/12/18    12/12/18   1797